{
  "hkgkjhbjhvvhv": {
    "_id": "hkgkjhbjhvvhv",
    "name": "Chocolate Soufflé",
    "imageUrl": "https://twoplaidaprons.com/wp-content/uploads/2022/02/chocolate-souffle-with-ganache.jpg",
    "ingredients": "½ cup bittersweet chocolate chips;\n3 oz (chocolate bars are good too);\n3 tablespoons milk;\n½ tablespoon unsalted butter plus extra for the ramekin;\n1 large egg yolk about 30g;\n1 teaspoon vanilla extract;\n2 large egg whites about 62g;\n3 tablespoons granulated sugar plus extra for dusting;\n1 teaspoon white vinegar.",
    "steps": "    Prepare the ramekin:\n    Preheat oven to 375°F.\n    Lightly grease the baking ramekin(s) with butter and dust with granulated sugar. Tap out excess sugar and clean off the rim of the ramekin.\n    For the chocolate base:\n    Combine the chocolate, milk, and butter in a heatproof bowl. Place the bowl on a pot of simmering water (double boiler). Constantly stir the ingredients until everything is melted and well combined. Remove from heat and set aside to cool until warm to the touch.\n    Add the egg yolk and vanilla. Mix until everything is well combined. Set aside until needed.\n    For the meringue:\n    Place the egg whites in a medium mixing bowl. Add the white vinegar or cream of tartar and beat on medium speed until foamy.\n    While mixing, gradually add the sugar, a little at a time. Once all of the sugar has been added, increase the speed to medium high and beat the meringue to stiff peak. The meringue should stand on a peak when lifted up.\n    *Feel free to pause the mixer in between adding the sugar. Also, refer to the post for photo reference of stiff peak meringue.*\n    To make the soufflé batter:\n    In three sessions, add a third of the meringue into the cooled chocolate base. Using a rubber spatula, gently incorporate the meringue using a \"J\" folding motion. Repeat two more times until all the meringue is added and well incorporated.\n    *Refer to the post for step by step photo reference!*\n    To bake the soufflé:\n    Pour the chocolate soufflé batter into the prepared ramekin and bake for 20 minutes. If making two smaller ramekins of soufflé decrease the bake time to 15 minutes.\n    *Make sure the actual oven temperature is at 375°F when you bake the soufflé. An oven thermometer is highly recommend to ensure the oven temperature is correct when baking. Also, avoid opening the oven while baking to prevent the soufflé from deflating.*\n    Serve the soufflé:\n    Serve the chocolate soufflé immediately with powdered sugar, whipped cream, ice cream, fresh fruits, and/or ganache.\n",
    "_ownerId": "35c62d76-8152-4626-8712-eeb96381bea8",
    "username": "Peter"
  },
  "8691ef58-26f3-47a9-b79f-10d7699bcb77": {
    "imageUrl": "https://sallysbakingaddiction.com/wp-content/uploads/2019/01/homemade-chocolate-truffles.jpg",
    "ingredients": "8 ounces of chocolate\n2/3 cup heavy cream\n1 ts butter\nVanilla extract",
    "name": "Chocolate Truffles",
    "steps": "    Warm Cream: Pour warm cream over chopped chocolate.\n    Do Nothing: Before stirring, let the warm cream and chocolate sit in the bowl for a few minutes. Don’t touch it!\n    Stir: Stir until the chocolate is melted.\n    Refrigerate: Refrigerate until the mixture is set, about 1-2 hours.\n    Roll: Roll into balls and coat in toppings like sprinkles, cocoa powder, or crushed nuts. You can also dip the truffles in melted or tempered chocolate. See my dark chocolate coconut rum truffles post for a video on how to do so. And I have an in-depth explanation for tempered chocolate in Sally’s Candy Addiction if you have a copy.",
    "_id": "8691ef58-26f3-47a9-b79f-10d7699bcb77",
    "_ownerId": "847ec027-f659-4086-8032-5173e2f9c93a",
    "username": "George"
  }
}